{
  "topSection": {
    "me": "Dr.-Ing. Julia Mucha",
    "re": "Requirements Engineering",
    "uxui": "UX/UI",
    "dev": "Frontend Development",
    "statement": "With creativity and structure, I support the planning and implementation of software projects. From requirements gathering to user interface development and implementation planning, I am here to offer guidance and assistance."
  },
   "navbar": {
    "about": "About"
  },
   "tags": {
    "re": "Requirements Engineering",
    "traceability": "Traceability",
    "uxui": "UX/UI",
    "frontend": "Frontend Development"
  },
   "portfolioPage": {
    "title": "Portfolio",
    "qdacity": {
        "title": "QDAcity - Tool for qualitative data analysis",
        "content": "QDAcity is a web application for conducting qualitative data analyses. User groups include researchers and market analysts who want to derive new insights from numerous, often textual, sources. Together with my two colleagues and with the support of students, we worked on the development of the application. My focus was on designing the user interfaces (UI) and improving the user experience (UX).",
        "linkToPage": "Official QDAcity Page",
        "linkToProjectDetails": "PDF [in German] about project details"
    },
    "climbingDiary": {
        "title": "Climbing Diary - your digital logbook for your vertical successes",
        "content": "The Climbing Diary is a mobile app for climbers and boulderers to log their projects and ascents and to analyze their performance. The goal of the case study is to capture the needs and expectations of users for such an app in order to improve its functionality, usability, and design.",
        "linkToGithub": "Link to Github Repository",
        "linkToProjectDetails": "PDF [in German] about project details"
    }
  },
   "blogPage": {
    "title": "Publications",
    "benefitsPaper": {
        "title": "Benefits about Pre-RS-Traceability",
        "content": "Abstract: Requirements traceability is the ability to trace requirements to other software engineering artifacts. Traceability can be classified as either pre- or post-requirements specifications (RS) traceability. Pre-RS traceability is the ability to trace between requirements and their origin. However, the benefits of pre-RS traceability are often not clear. In this article, we systematically lay out the benefits of pre-RS traceability. We present results from both a literature review and a qualitative survey of practitioners involved with documenting and utilizing such trace links. We find that the benefits strongly depend on the practitioners, their tasks, and the project environment. Awareness of these relationships supports a clearer understanding of the benefits of pre-RS traceability and thus motivates successful implementation of the required practices. The results of our research motivates the adoption of pre-RS traceability and present problem areas for future research.",
        "linkIEEE": "Published in 2022 IEEE 30th International Requirements Engineering Conference (RE)"
    },
    "slrPaper": {
        "title": "A systematic literature review of pre-requirements specification traceability",
        "content": "Abstract: Requirements traceability (RT) is the ability to link requirements to other software development artifacts. In pre-requirements (pre-RS) traceability, requirements are linked to their origin, such as interviews with stakeholders, meeting protocols, or legacy systems. Compared with post-RS traceability, which links requirements to source code and other later artifacts, pre-RS traceability has seen much less research. This article presents a systematic literature review of pre-RS traceability based on 77 articles published between 1992 and 2022, aiming to provide a comprehensive overview of its use cases, benefits, problems, and solutions. Through the analysis of existing literature, this review identifies gaps for future research and establishes a foundation for future investigations in the field of pre-RS traceability.",
        "linkArticle": "Journal Article published in Requirements Engineering Springer",
        "linkTechReport": "Code System published as technical report"
    },
    "diss": {
        "title": "Dissertation: The QDAcity-RE-RS Method for Creating Complete, Consistent, and Traceable Requirements Specifications",
        "content": "Resolving issues that arise in a software project becomes more expensive as the project advances. Hence, it is crucial for a requirements engineer to develop a complete, consistent, and traceable requirements specification (RS). To create such a high-quality RS, the requirements engineer must develop a deep understanding of the problem domain. In science, researchers face a similar challenge when building theories. Constructing a theory requires considering all related resources to capture a broad diversity of characteristics. In addition, researchers must document the theory-building process to demonstrate high quality and ensure traceability for other researchers who want to build on the theory. Therefore, researchers developed methods for theory building, from which we draw inspiration for our research.",
        "linkPublication": "Published at Friedrich-Alexander University"
    }
  },
  "impressum": {
    "title": "Impressum"
  },
  "uxui": {
    "section": {
      "title": "UX/UI Design",
      "content": "I do UX/UI design to make applications more usable and look friendlier. I also design and develop websites. Thanks to my studies, I have background knowledge from software development, which simplifies the planning and implementation of new interaction concepts and interfaces."
    }
  },
  "aboutMe": {
    "section": {
      "title": "About me",
      "personal": "I am Julia. I love to paint and design analogue as well as digital. Unfortunately, I also like to travel and climb. I always have a pen and notebook with me. If space allows, the colors will be included.",
      "professional": "I am a self-taught designer and artist. I studied computer science of media at the Technical University of Dresden. The course expanded my creative scope to the digital world and deepened my knowledge of software development. Finde my CV on <link1>LinkedIn</link1>.",
      "claim": "I love to plan and implement new ideas analogously or digitally and to accompany existing projects creatively and energetically."
    }
  },
  "legalDisclosure": {
    "id" : "Information in accordance with Section 5 TMG\n \n Julia Mucha\n Gostenhofer Schulgasse 32 \n 90443 Nuremberg  \n \n",
    "represented" : "Represented by:\n Julia Mucha\n Contact:\n Phone: +49 1733653554\n Email:", 
    "contact" : "Responsible for content according to Section 55, paragraph 2 RStV:\n Julia Mucha \n Gostenhofer Schulgasse 32\n 90443 Nuremberg \n",
    "disclaimer" : "Disclaimer:\n\nLiability for Content\n\n The content of our pages has been created with the utmost care. However, we cannot guarantee the accuracy, completeness, or timeliness of the content. As a service provider, we are responsible for our own content on these pages according to general laws per Section 7, paragraph 1 TMG. However, according to Sections 8 to 10 TMG, we are not obligated to monitor transmitted or stored external information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information according to general laws remain unaffected. However, liability in this regard is only possible from the point in time at which a specific infringement becomes known. Upon becoming aware of corresponding infringements, we will remove these contents immediately.\n\nLiability for Links\n\n Our offer contains links to external websites of third parties, on whose content we have no influence. Therefore, we cannot assume any liability for these external contents. The respective provider or operator of the pages is always responsible for the content of the linked pages. The linked pages were checked for possible legal violations at the time of linking. Illegal contents were not recognizable at the time of linking. Permanent monitoring of the content of the linked pages is not reasonable without concrete evidence of a violation. Upon becoming aware of legal violations, we will remove such links immediately.\n\nData Protection\n\n The use of our website is generally possible without providing personal data. Insofar as personal data (such as name, address, or email addresses) is collected on our pages, this is always done on a voluntary basis as much as possible. This data will not be disclosed to third parties without your explicit consent. \n We point out that data transmission over the internet (e.g., communication by email) can have security gaps. Complete protection of data from access by third parties is not possible. \n The use of contact data published within the scope of the legal disclosure obligation by third parties for the transmission of unsolicited advertising and information materials is hereby expressly prohibited. The operators of the pages expressly reserve the right to take legal action in the event of the unsolicited sending of advertising information, such as spam emails.\n\nGoogle Analytics\n\n This website uses Google Analytics, a web analytics service provided by Google Inc. (Google). Google Analytics uses cookies, which are text files placed on your computer, to help the website analyze how users use the site. The information generated by the cookie about your use of the website (including your IP address) will be transmitted to and stored by Google on servers in the United States. Google will use this information to evaluate your use of the website, to compile reports on website activity for website operators, and to provide other services related to website activity and internet usage. Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google's behalf. Google will not associate your IP address with any other data held by Google. You may refuse the use of cookies by selecting the appropriate settings on your browser; however, please note that if you do this you may not be able to use the full functionality of this website. By using this website, you consent to the processing of data about you by Google in the manner and for the purposes set out above."
    }
}
